In [6]:
import pandas as pd

# Read HTML file
df_list = pd.read_html("sample1.html")  # Returns a list of DataFrames

# Extract the first (or only) table
df = df_list[0]  

# Display the DataFrame
print(df.head())

         Name  Age Grade
0    John Doe   20     A
1  Jane Smith   21    B+
2  Sam Wilson   22    A-
3  emma stone   21    B+
4   Sam smith   26    A-

In [7]:
df

           Name  Age Grade
0      John Doe   20     A
1    Jane Smith   21    B+
2    Sam Wilson   22    A-
3    emma stone   21    B+
4     Sam smith   26    A-
5  taylor swift   26    A-

In [8]:
df.dtypes

Name     object
Age       int64
Grade    object
dtype: object

In [9]:
df.shape

(6, 3)

In [10]:
df['school']='keshavraj'

In [11]:
df

           Name  Age Grade     school
0      John Doe   20     A  keshavraj
1    Jane Smith   21    B+  keshavraj
2    Sam Wilson   22    A-  keshavraj
3    emma stone   21    B+  keshavraj
4     Sam smith   26    A-  keshavraj
5  taylor swift   26    A-  keshavraj

In [12]:
df.shape

(6, 4)

In [14]:
df.describe()

             Age
count   6.000000
mean   22.666667
std     2.658320
min    20.000000
25%    21.000000
50%    21.500000
75%    25.000000
max    26.000000

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   Age     6 non-null      int64
 2   Grade   6 non-null      object
 3   school  6 non-null      object
dtypes: int64(1), object(3)
memory usage: 324.0+ bytes

In [16]:
df.isnull()

    Name    Age  Grade  school
0  False  False  False   False
1  False  False  False   False
2  False  False  False   False
3  False  False  False   False
4  False  False  False   False
5  False  False  False   False

In [17]:
df.isnull

<bound method DataFrame.isnull of            Name  Age Grade     school
0      John Doe   20     A  keshavraj
1    Jane Smith   21    B+  keshavraj
2    Sam Wilson   22    A-  keshavraj
3    emma stone   21    B+  keshavraj
4     Sam smith   26    A-  keshavraj
5  taylor swift   26    A-  keshavraj>

In [19]:
df['Name']

0        John Doe
1      Jane Smith
2      Sam Wilson
3      emma stone
4       Sam smith
5    taylor swift
Name: Name, dtype: object

In [21]:
max_age=df['Age'].max()

In [22]:
max_age

26